I am also having this problem in 2 different clusters that are configured using this module. I see that some changes are related to AMI not being specified but doesn't seem the only one.

Version: Terraform v0.13.1
Module Version: 12.2.0
Configuration:

```
module "eks" {
  source  = "terraform-aws-modules/eks/aws"
  version = "12.2.0"

  vpc_id          = module.vpc.vpc_id
  cluster_name    = var.cluster_name
  cluster_version = var.cluster_version
  subnets         = module.vpc.private_subnets

  tags = {
    Terraform   = "true"
    Environment = var.environment
  }

  cluster_encryption_config = [
    {
      provider_key_arn = aws_kms_key.eks.arn
      resources        = ["secrets"]
    }
  ]

  cluster_enabled_log_types     = ["api", "audit", "authenticator", "controllerManager", "scheduler"]
  cluster_log_retention_in_days = 30

  worker_groups = [
    {
      name                 = var.cluster_worker_group_name
      instance_type        = var.cluster_worker_group_instance_type
      asg_desired_capacity = var.cluster_worker_group_asg_desired_capacity
    }
  ]

  map_roles    = var.cluster_map_roles
  map_users    = var.cluster_map_users
  map_accounts = var.cluster_map_accounts
}
```

Change manifest:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.environment.module.eks.aws_autoscaling_group.workers[0] will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        arn                       = "arn:aws:autoscaling:us-east-2:XXX:autoScalingGroup:YYY:autoScalingGroupName/tst-eks-worker-group-default2020102915033234360000000d"
        availability_zones        = [
            "us-east-2a",
            "us-east-2b",
            "us-east-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 2
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "EC2"
        id                        = "tst-eks-worker-group-default2020102915033234360000000d"
      ~ launch_configuration      = "tst-eks-worker-group-default20201029153833268400000001" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 3
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "tst-eks-worker-group-default2020102915033234360000000d"
        name_prefix               = "tst-eks-worker-group-default"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::XXX:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = [
            "AZRebalance",
        ]
        tags                      = [
            {
                "key"                 = "Name"
                "propagate_at_launch" = "true"
                "value"               = "tst-eks-worker-group-default-eks_asg"
            },
            {
                "key"                 = "Terraform"
                "propagate_at_launch" = "true"
                "value"               = "true"
            },
            {
                "key"                 = "k8s.io/cluster/tst-eks"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
            {
                "key"                 = "kubernetes.io/cluster/tst-eks"
                "propagate_at_launch" = "true"
                "value"               = "owned"
            },
        ]
        target_group_arns         = []
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-111",
            "subnet-222",
            "subnet-333",
        ]
        wait_for_capacity_timeout = "10m"
    }

  # module.environment.module.eks.aws_launch_configuration.workers[0] must be replaced
+/- resource "aws_launch_configuration" "workers" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:XXX:launchConfiguration:XZZZ:launchConfigurationName/tst-eks-worker-group-default20201029153833268400000001" -> (known after apply)
        associate_public_ip_address      = false
        ebs_optimized                    = false
        enable_monitoring                = true
        iam_instance_profile             = "tst-eks20201029150315481600000008"
      ~ id                               = "tst-eks-worker-group-default20201029153833268400000001" -> (known after apply)
      ~ image_id                         = "ami-0dc6bc43da1b962d8" -> "ami-005ecc78d7cd1157d" # forces replacement
        instance_type                    = "t2.medium"
      + key_name                         = (known after apply)
      ~ name                             = "tst-eks-worker-group-default20201029153833268400000001" -> (known after apply)
        name_prefix                      = "tst-eks-worker-group-default"
        security_groups                  = [
            "sg-444",
        ]
        user_data_base64                 = "****"
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

        root_block_device {
            delete_on_termination = true
            encrypted             = false
            iops                  = 0
            volume_size           = 100
            volume_type           = "gp2"
        }
    }

  # module.environment.module.eks.random_pet.workers[0] must be replaced
+/- resource "random_pet" "workers" {
      ~ id        = "touching-cheetah" -> (known after apply)
      ~ keepers   = {
          - "lc_name" = "tst-eks-worker-group-default20201029153833268400000001"
        } -> (known after apply) # forces replacement
        length    = 2
        separator = "-"
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```